Revit 2024 API
LinePattern.GetSegments Method
 Gets the sequence of segments that defines this line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<LinePatternSegment> GetSegments()
Visual Basic
Public Function GetSegments As IList(Of LinePatternSegment)
Visual C++
public:
IList<LinePatternSegment^>^ GetSegments()
Return Value
 The sequence of segments.
See Also
LinePattern Class
Autodesk.Revit.DB Namespace